{
    "<add>": "<add> takes two or more numbers and computes their sum. For example, if a football team scored 251 points in the first half and 117 points in the second half, then they scored <add>(251, 117)=368 points.",
    "<subtract>": "<subtract> takes two numbers and computes their difference. For example, if a restaurant has 311 bottles of soda in stock and they use 226 bottles of soda to serve customers, they will have <subtract>(311, 226)=85 bottles of soda left.",
    "<multiply>": "<multiply> takes two or more numbers and computes their product. For example, if a car travels at a speed of 280 kilometers per hour for 457 hours, it will travel <multiply>(280, 457)=127960 kilometers in total.",
    "<divide>": "<divide> takes two numbers and computes their ratio. For example, if a store sells 2356 items and has a total revenue of 1284.98 dollars, the average price of an item is <divide>(1284.98, 2356)=1.83 dollars.",
    "<power>": "<power> takes two numbers and raises the first to the second. For example, if a virus spreads by tripling its infected population every hour, after 4 hours there will be 3^4=81 times as many infected people as before.",
    "<sqrt>": "<sqrt> takes one number and computes its square root, that is, the inverse of the square. For example, if a square has an area of 559 square inches, then the length of its side is <sqrt>(559)=23.64 inches.",
    "<log>": "<log> takes one number and computes its logarithm base 10. For example, if 10^x=2091, then x=<log>(2091)=3.32.",
    "<ln>": "<ln> takes one number and computes its natural logarithm, that is, the inverse of the exponential function e^n. For example, if e^x=667.21 then x=<ln>(667.21)=6.5",
    "<lcm>": "<lcm> takes two or more integers and computes their least common multiple. For example, if a factory produces 928 products every 267 hours, the least amount of time it will take to produce the same number of products on two consecutive days is <lcm>(928,267)=247776.",
    "<gcd>": "<gcd> takes two or more integers and computes their greatest common divisor. For example, if 639 friends want to split a pizza with 723 slices evenly among themselves, the maximum number of slices each friend can have is <gcd>(723,638)=1.",
    "<remainder>": "<remainder> takes two integers and it computes the mod, that is, the remainder after the first integer is divided by the second integer. For example, if a pizza restaurant has 6650 pizzas to distribute among 3340 customers, and each customer can only have one pizza, there will be <remainder>(6650,3340)=3310 pizzas left over.",
    "<choose>": "<choose> takes two integers n and k and it computes the number of ways that k things can be selected out of n things. For example, if a sports team has 7 players and the coach wants to select a starting lineup of 2 players, he can select <choose>(7, 2)=21 different possible lineups.",
    "<permutate>": "<permutate> takes two integers n and k and it computes the number of possible ordered arrangements of k distinct elements selected from the n elements. For example, if a a music playlist has 11 songs on it and we want to play 4 songs from it in a row, there are <permutate>(11,4)=7920 ways to do it."
}